matlab-caffe.org
#+TITLE:     Matlab Caffe 配置筆記
#+AUTHOR:    fatfingererr
#+EMAIL:     (concat "fatfingererr" at-sign "gmail.com")
#+DATE:      2017--
#+LANGUAGE:  zh-TW
#+OPTIONS:   H:4 num:nil toc:2
#+SETUPFILE: theme-readtheorg.setup

#+begin_EXPORT html
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right">
<a href="https://www.ffe.tw/series.html" class="fa fa-home"> Blog</a>&nbsp;&nbsp;|&nbsp;&nbsp;
<a href="https://github.com/fatfingererr/note/blob/master/matlab-caffe.org" class="fa fa-github"> GitHub</a>
</div>
#+end_EXPORT

-----

* 安裝 Visual Studio Community 2015
- 下載地址：[[https://www.visualstudio.com/zh-hant/downloads/][Downloads | Visual Studio Official Site]]
- 不用登入，選擇 Visual Studio Community 2015 下載社區版


* 安裝 nVidia CUDA 
- 下載地址：[[https://developer.nvidia.com/cuda-downloads][CUDA 8.0 Downloads | NVIDIA Developer]]
- 使用版本為 8.0.61
- 離線安裝的檔案蠻大的 1G 左右
  - 可以選擇 Installer Type 為 network 下載網路連線安裝版的 exe
  - 個人下載 network 版本一直連不到 network，所以下載 local 離線安裝
  - 一直下一頁，正常安裝到結束就關掉，後面開啟的視窗都不要管關閉即可

* 安裝 nVidia cuDNN
- 下載地址：[[https://developer.nvidia.com/rdp/cudnn-download][cuDNN Download | NVIDIA Developer]]
- 要加入 nVidia 會員，要到信箱收確認信
- 使用版本為 cuDNN v5 for CUDA 8.0 中的 cuDNN v5 Library for Windows 10
- 點開始直接打 cmd 開啟 cmd 找你的 CUDA 安裝路徑，輸入：

#+BEGIN_SRC bash
C:\Users\你的名字>echo %CUDA_PATH%
C:\Program Files\NVIDIA GPU Computing Toolkit\CUDA\v8.0
#+END_SRC

- 把 cuDNN 下載壓縮檔解壓縮到這個路徑底下，名字改成 cuDNN
  - cuDNN 目錄裡面應該要有個資料夾叫 cuda 而不是直接 cuda 資料夾解壓縮出來

* 安裝 Microsoft/caffe
- 你得會用 git 請 clone 到你的資料夾底下，這邊稱做 ms-caffe

#+BEGIN_SRC bash
git clone https://github.com/Microsoft/caffe.git ms-caffe
cd ms-caffe
#+END_SRC

- 在目錄 ms-caffe/Windows 中找 CommonSettings.props.example
- 複製一份然後把名字改成沒有 example

#+BEGIN_SRC bash
cd windows
copy CommonSettings.props.example CommonSettings.props
#+END_SRC

- 開啟 CommonSettings.props
- 搜尋 cuDnnPath 找到 cuDnnPath 標籤，添加 cuDNN 路徑

#+BEGIN_SRC xml
...
<cuDnnPath>C:\Program Files\NVIDIA GPU Computing Toolkit\CUDA\v8.0\cuDNN</cuDnnPath>
...
#+END_SRC

- 搜尋 MatlabDir 找到 MatlabDir 標籤，添加 Matlab 路徑

#+BEGIN_SRC xml
...
<MatlabDir>C:\Program Files\MATLAB\R2016a</MatlabDir>
...
#+END_SRC

- 搜尋 MatlabSupport 找到 MatlabSupport 標籤，設定為 true 支援 Matlab

#+BEGIN_SRC xml
...
<MatlabSupport>true</MatlabSupport>
...
#+END_SRC



#+begin_warning
筆記還在紀錄中尚未完全完成，下方若有參考資料可先行閱讀
#+end_warning

-----
* 參考資料
***** 1. [[http://blog.csdn.net/ws_20100/article/details/50525879][caffe的Matlab接口的使用方法 - Schr&#246;dinger's Cat - 博客频道 - CSDN.NET]]
***** 2. [[http://blog.csdn.net/kkk584520/article/details/49475633][在MATLAB下调试Caffe - 卜居  - 博客频道 - CSDN.NET]]
***** 3. [[http://blog.sina.com.cn/s/blog_a5fdbf010102w3av.html][Caffe学习之一：Caffe的配置和编译_debug_新浪博客]]
***** 4. [[http://blog.itpub.net/16582684/viewspace-1268749/][Matlab 使用caffe示例-std1984-ITPUB博客]]
***** 5. [[https://read01.com/J05737.html][caffe windows  Matlab - 壹讀]]
***** 6. [[https://www.zhihu.com/question/52471448][caffe中训练出来的model怎么样提取出来在matlab中使用？ - 机器学习 - 知乎]]
***** 7. [[http://www.cnblogs.com/laiqun/p/6031925.html][ubuntu下 编译Caffe的Matlab接口 - QQLQ - 博客园]]
***** 8. [[http://coldmooon.github.io/2015/07/09/caffe/][Caffe 安装错误记录及解决办法 - Coldmooon's Blog]]
***** 9. [[https://www.zybuluo.com/hanxiaoyang/note/526510][caffe MATLAB 图像识别 - 作业部落 Cmd Markdown 编辑阅读器]]
***** 10. [[http://www.dongcoder.com/detail-100486.html][	caffe在windows 下的配置及matlab接口编译（无GPU）-懂客-dongcoder.com]]
***** 11. [[http://jesse1029.pixnet.net/blog/post/46006115-caffe][【紀錄】簡單記錄一下Caffe的Note @ A little space in my mind :: 痞客邦 PIXNET ::]]
***** 12. (推薦) [[http://www.tqcto.com/article/framework/9204.html][windows 10 下 Caffe + Matlab 部署 - web开发 - 爱上编程技术博客]]


     -----
     #+begin_note
     右下角的 *OPEN CHAT* 可以即時討論，歡迎留言給予建議與指教，也可以與我打個招呼
     #+end_note

     #+BEGIN_EXPORT html
     <script>
     ((window.gitter = {}).chat = {}).options = {
     room: 'fatfingererr-notes/Lobby'
     };
     </script>
     <script src="https://sidecar.gitter.im/dist/sidecar.v1.js" async defer></script>
     #+END_EXPORT
