docs/matlab-caffe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-TW" xml:lang="zh-TW">
<head>
<!-- 2017-02-09 Thu 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Matlab Caffe 配置筆記</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="fatfingererr" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Matlab Caffe 配置筆記</h1>
<div id="table-of-contents">
<h2>&#30446;&#37636;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgac568a6">安裝 Visual Studio Community 2015</a></li>
<li><a href="#org46c86b4">安裝 nVidia CUDA</a></li>
<li><a href="#org9c229ee">安裝 nVidia cuDNN</a></li>
<li><a href="#org8131391">安裝 Microsoft/caffe</a></li>
<li><a href="#orgb9f556f">參考資料</a></li>
</ul>
</div>
</div>
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right">
<a href="https://www.ffe.tw/series.html" class="fa fa-home"> Blog</a>&nbsp;&nbsp;|&nbsp;&nbsp;
<a href="https://github.com/fatfingererr/note/blob/master/matlab-caffe.org" class="fa fa-github"> GitHub</a>
</div>

<hr  />

<div id="outline-container-orgac568a6" class="outline-2">
<h2 id="orgac568a6">安裝 Visual Studio Community 2015</h2>
<div class="outline-text-2" id="text-orgac568a6">
<ul class="org-ul">
<li>下載地址：<a href="https://www.visualstudio.com/zh-hant/downloads/">Downloads | Visual Studio Official Site</a></li>
<li>不用登入，選擇 Visual Studio Community 2015 下載社區版</li>
</ul>
</div>
</div>


<div id="outline-container-org46c86b4" class="outline-2">
<h2 id="org46c86b4">安裝 nVidia CUDA</h2>
<div class="outline-text-2" id="text-org46c86b4">
<ul class="org-ul">
<li>下載地址：<a href="https://developer.nvidia.com/cuda-downloads">CUDA 8.0 Downloads | NVIDIA Developer</a></li>
<li>使用版本為 8.0.61</li>
<li>離線安裝的檔案蠻大的 1G 左右
<ul class="org-ul">
<li>可以選擇 Installer Type 為 network 下載網路連線安裝版的 exe</li>
<li>個人下載 network 版本一直連不到 network，所以下載 local 離線安裝</li>
<li>一直下一頁，正常安裝到結束就關掉，後面開啟的視窗都不要管關閉即可</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9c229ee" class="outline-2">
<h2 id="org9c229ee">安裝 nVidia cuDNN</h2>
<div class="outline-text-2" id="text-org9c229ee">
<ul class="org-ul">
<li>下載地址：<a href="https://developer.nvidia.com/rdp/cudnn-download">cuDNN Download | NVIDIA Developer</a></li>
<li>要加入 nVidia 會員，要到信箱收確認信</li>
<li>使用版本為 cuDNN v5 for CUDA 8.0 中的 cuDNN v5 Library for Windows 10</li>
<li>點開始直接打 cmd 開啟 cmd 找你的 CUDA 安裝路徑，輸入：</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">C:\Users\&#20320;&#30340;&#21517;&#23383;&gt;echo %CUDA_PATH%
C:\Program Files\NVIDIA GPU Computing Toolkit\CUDA\v8.0
</pre>
</div>

<ul class="org-ul">
<li>把 cuDNN 下載壓縮檔解壓縮到這個路徑底下，名字改成 cuDNN
<ul class="org-ul">
<li>cuDNN 目錄裡面應該要有個資料夾叫 cuda 而不是直接 cuda 資料夾解壓縮出來</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8131391" class="outline-2">
<h2 id="org8131391">安裝 Microsoft/caffe</h2>
<div class="outline-text-2" id="text-org8131391">
<ul class="org-ul">
<li>你得會用 git 請 clone 到你的資料夾底下，這邊稱做 ms-caffe</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/Microsoft/caffe.git ms-caffe
<span style="color: #4f97d7;">cd</span> ms-caffe
</pre>
</div>

<ul class="org-ul">
<li>在目錄 ms-caffe/Windows 中找 CommonSettings.props.example</li>
<li>複製一份然後把名字改成沒有 example</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">cd</span> windows
copy CommonSettings.props.example CommonSettings.props
</pre>
</div>

<ul class="org-ul">
<li>開啟 CommonSettings.props</li>
<li>搜尋 cuDnnPath 找到 cuDnnPath 標籤，添加 cuDNN 路徑</li>
</ul>

<div class="org-src-container">
<pre class="src src-xml">...
&lt;<span style="color: #bc6ec5; font-weight: bold;">cuDnnPath</span>&gt;C:\Program Files\NVIDIA GPU Computing Toolkit\CUDA\v8.0\cuDNN&lt;/<span style="color: #bc6ec5; font-weight: bold;">cuDnnPath</span>&gt;
...
</pre>
</div>

<ul class="org-ul">
<li>搜尋 MatlabDir 找到 MatlabDir 標籤，添加 Matlab 路徑</li>
</ul>

<div class="org-src-container">
<pre class="src src-xml">...
&lt;<span style="color: #bc6ec5; font-weight: bold;">MatlabDir</span>&gt;C:\Program Files\MATLAB\R2016a&lt;/<span style="color: #bc6ec5; font-weight: bold;">MatlabDir</span>&gt;
...
</pre>
</div>

<ul class="org-ul">
<li>搜尋 MatlabSupport 找到 MatlabSupport 標籤，設定為 true 支援 Matlab</li>
</ul>

<div class="org-src-container">
<pre class="src src-xml">...
&lt;<span style="color: #bc6ec5; font-weight: bold;">MatlabSupport</span>&gt;true&lt;/<span style="color: #bc6ec5; font-weight: bold;">MatlabSupport</span>&gt;
...
</pre>
</div>



<div class="warning">
<p>
筆記還在紀錄中尚未完全完成，下方若有參考資料可先行閱讀
</p>

</div>

<hr  />
</div>
</div>
<div id="outline-container-orgb9f556f" class="outline-2">
<h2 id="orgb9f556f">參考資料</h2>
<div class="outline-text-2" id="text-orgb9f556f">
</div><ul class="org-ul"><li><a id="orgab69a0c"></a>1. <a href="http://blog.csdn.net/ws_20100/article/details/50525879">caffe的Matlab接口的使用方法 - Schr&amp;#246;dinger's Cat - 博客频道 - CSDN.NET</a><br  /></li>
<li><a id="org05046be"></a>2. <a href="http://blog.csdn.net/kkk584520/article/details/49475633">在MATLAB下调试Caffe - 卜居  - 博客频道 - CSDN.NET</a><br  /></li>
<li><a id="org1791861"></a>3. <a href="http://blog.sina.com.cn/s/blog_a5fdbf010102w3av.html">Caffe学习之一：Caffe的配置和编译<sub>debug</sub><sub>新浪博客</sub></a><br  /></li>
<li><a id="org9f8ba5c"></a>4. <a href="http://blog.itpub.net/16582684/viewspace-1268749/">Matlab 使用caffe示例-std1984-ITPUB博客</a><br  /></li>
<li><a id="org01c3bd1"></a>5. <a href="https://read01.com/J05737.html">caffe windows  Matlab - 壹讀</a><br  /></li>
<li><a id="orgfe22ea8"></a>6. <a href="https://www.zhihu.com/question/52471448">caffe中训练出来的model怎么样提取出来在matlab中使用？ - 机器学习 - 知乎</a><br  /></li>
<li><a id="orgef86b12"></a>7. <a href="http://www.cnblogs.com/laiqun/p/6031925.html">ubuntu下 编译Caffe的Matlab接口 - QQLQ - 博客园</a><br  /></li>
<li><a id="orgfae52b8"></a>8. <a href="http://coldmooon.github.io/2015/07/09/caffe/">Caffe 安装错误记录及解决办法 - Coldmooon's Blog</a><br  /></li>
<li><a id="orgd9d83f7"></a>9. <a href="https://www.zybuluo.com/hanxiaoyang/note/526510">caffe MATLAB 图像识别 - 作业部落 Cmd Markdown 编辑阅读器</a><br  /></li>
<li><a id="orgdc1d8d6"></a>10. <a href="http://www.dongcoder.com/detail-100486.html">	caffe在windows 下的配置及matlab接口编译（无GPU）-懂客-dongcoder.com</a><br  /></li>
<li><a id="org80f80ea"></a>11. <a href="http://jesse1029.pixnet.net/blog/post/46006115-caffe">【紀錄】簡單記錄一下Caffe的Note @ A little space in my mind :: 痞客邦 PIXNET ::</a><br  /></li>
<li><a id="org1d3b1e7"></a>12. (推薦) <a href="http://www.tqcto.com/article/framework/9204.html">windows 10 下 Caffe + Matlab 部署 - web开发 - 爱上编程技术博客</a><br  /><div class="outline-text-6" id="text-org1d3b1e7">
<hr  />
<div class="note">
<p>
右下角的 <b>OPEN CHAT</b> 可以即時討論，歡迎留言給予建議與指教，也可以與我打個招呼
</p>

</div>

<script>
((window.gitter = {}).chat = {}).options = {
room: 'fatfingererr-notes/Lobby'
};
</script>
<script src="https://sidecar.gitter.im/dist/sidecar.v1.js" async defer></script>
</div></li></ul>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#26399;: 2017--</p>
<p class="author">&#20316;&#32773;: fatfingererr</p>
<p class="date">Created: 2017-02-09 Thu 15:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
